test/com/amazon/payments/paywithamazon/impl/ipn/json/AuthorizeNotification.json

{  
    "Type" : "Notification", 
    "MessageId" : "2288e071-de8e-5b6b-9f03-aeb15ba02de2", 
    "TopicArn" : "arn:aws:sns:us-east-1:291180941288:A3BXB0YN3XH17HA2K7NDRCTOTPW9",  
    "Message" : "{\"MarketplaceID\":\"A3BXB0YN3XH17H\",\"ReleaseEnvironment\":\"Sandbox\",\"Version\":\"2013-01-01\",\"NotificationType\":\"PaymentAuthorize\",\"SellerId\":\"A2K7NDRCTOTPW9\",\"NotificationReferenceId\":\"1111111-1111-11111-1111-11111EXAMPLE\",\"IsSample\":true,\"Timestamp\":\"2015-11-14T00:40:14.284Z\",\"NotificationData\":\"<?xml version=\\\"1.0\\\" encoding=\\\"UTF-8\\\"?>\\n\\t            <AuthorizationNotification xmlns=\\\"https://mws.amazonservices.com/ipn/OffAmazonPayments/2013-01-01\\\">\\n\\t            <AuthorizationDetails>\\n\\t            <AmazonAuthorizationId>P01-0000000-0000000-000000<\\/AmazonAuthorizationId>\\n\\t            <AuthorizationReferenceId>P01-0000000-0000000-Ref<\\/AuthorizationReferenceId>\\n\\t            <AuthorizationAmount>\\n\\t                <Amount>5.0<\\/Amount>\\n\\t                <CurrencyCode>USD<\\/CurrencyCode>\\n\\t            <\\/AuthorizationAmount>\\n\\t            <CapturedAmount>\\n\\t                <Amount>4.0<\\/Amount>\\n\\t                <CurrencyCode>USD<\\/CurrencyCode>\\n\\t            <\\/CapturedAmount>\\n\\t            <AuthorizationFee>\\n\\t                <Amount>0.4<\\/Amount>\\n\\t                <CurrencyCode>USD<\\/CurrencyCode>\\n\\t            <\\/AuthorizationFee>\\n\\t            <IdList />\\n\\t            <CreationTimestamp>2013-01-01T01:01:01.001Z<\\/CreationTimestamp>\\n\\t            <ExpirationTimestamp>2013-03-01T01:01:01.001Z<\\/ExpirationTimestamp>\\n\\t            <AuthorizationStatus>\\n\\t                <State>Closed<\\/State>   \\n\\t                <LastUpdateTimestamp>2014-01-01T01:01:01.001Z<\\/LastUpdateTimestamp>\\n\\t                <ReasonCode>MaxCapturesProcessed<\\/ReasonCode>\\n\\t            <\\/AuthorizationStatus>\\n\\t            <OrderItemCategories />\\n\\t            <CaptureNow>true<\\/CaptureNow>\\n                <SoftDescriptor>AMZ*softDescriptor<\\/SoftDescriptor>\\n\\t        <\\/AuthorizationDetails>\\n\\t        <\\/AuthorizationNotification>\"}",  "Timestamp" : "2015-11-14T00:40:14.410Z",  "SignatureVersion" : "1",  "Signature" : "UYXJSjdUFf34GIVd4gQVIwL0wPotmPPky2uyPPO/eWvgFL2IAahPqKnsWT/G0AArILvh3DjqUyYaBS/HxgKDegRsvj6eDTMZ6PwrvBZsmz6W93dwV2VOzuZCgPj50i3U9JDGrPEXU4WAel34Z8QdKFuHkIjOQ8/uST5u6WFcntcOz1QgyNxSRmQk6lr1puOSBbtlXvF9ibsTGgcBrVs5B0H6oSeqVfnoSimuD0cJaXqb65rvkVIyE/KJIh0NdAl5n/72XuyrCdNYv9JPQUCExYuTYcTS7MqCXJs7P7eJoT71A9J7yTom4XmZInMWGbPAggcIxAFivj6e43KRBFm9qw==",  
    "SigningCertURL" : "https://sns.us-east-1.amazonaws.com/SimpleNotificationService-bb750dd426d95ee9390147a5624348ee.pem", 
    "UnsubscribeURL" : "https://sns.us-east-1.amazonaws.com/?Action=Unsubscribe&SubscriptionArn=arn:aws:sns:us-east-1:291180941288:A3BXB0YN3XH17HA2K7NDRCTOTPW9:05542723-375e-4609-98f1-8abcf427d95f"
}
