test/com/amazon/payments/paywithamazon/impl/ipn/json/ProviderReversalCredit.json

{  "Type" : "Notification",  
    "MessageId" : "c47750c4-f406-58e1-8910-1e07c2d2922a",  
    "TopicArn" : "arn:aws:sns:us-east-1:291180941288:A3BXB0YN3XH17HA2K7NDRCTOTPW9",  
    "Message" : "{\"ReleaseEnvironment\":\"Sandbox\",\"MarketplaceID\":\"623690\",\"Version\":\"2013-01-01\",\"NotificationType\":\"ProviderCreditReversal\",\"SellerId\":\"A37GX652OWOXVH\",\"NotificationReferenceId\":\"75e90ed5-4fee-40bc-ad6e-cb8c6e7f1a43a2k7ndrctotpw9\",\"Timestamp\":\"2015-11-16T01:42:44Z\",\"NotificationData\":\"<?xml version=\\\"1.0\\\" encoding=\\\"UTF-8\\\"?><ProviderCreditReversalNotification xmlns=\\\"https://mws.amazonservices.com/ipn/OffAmazonPayments/2013-01-01\\\">\\n    <ProviderCreditReversalDetails>\\n        <AmazonProviderCreditReversalId>S01-3154248-3064261-Q087635<\\/AmazonProviderCreditReversalId>\\n        <SellerId>A37GX652OWOXVH<\\/SellerId>\\n        <ProviderSellerId>A2K7NDRCTOTPW9<\\/ProviderSellerId>\\n        <CreditReversalReferenceId>rcMzEdsAprId<\\/CreditReversalReferenceId>\\n        <CreditReversalAmount>\\n            <Amount>0.5<\\/Amount>\\n            <CurrencyCode>USD<\\/CurrencyCode>\\n        <\\/CreditReversalAmount>\\n        <CreationTimestamp>2015-11-16T01:42:43.941Z<\\/CreationTimestamp>\\n        <CreditReversalStatus>\\n            <State>Completed<\\/State>\\n            <LastUpdateTimestamp>2015-11-16T01:42:44.078Z<\\/LastUpdateTimestamp>\\n        <\\/CreditReversalStatus>\\n    <\\/ProviderCreditReversalDetails>\\n<\\/ProviderCreditReversalNotification>\"}",  
    "Timestamp" : "2015-11-16T01:42:44.615Z",  
    "SignatureVersion" : "1",  
    "Signature" : "L84iVg+P8n+NfYPhJPuMjCMBPidD0MGOzFeCyTkwmn1Lmp9TceXleCBwUrQDhjW8vP9UnUZV2FX3GifaM7H4tarWmhsQUsvGysnOJvxRjx1yCRdsVDUYdSjKnq0FgpoGmtIxRDXbSpYZio2x6Q93uzCJIqZdyzTm0NVjtqRNcZrs8bRCva3vEnISqp7GsJ/fPy6tVovN+iZk37S55WA1cm4p4GDWQWVQ3SZCjKQ8DmX3qmbu9LQVs73QP5A2Li6w3RHV2xy95zi5BM+kZAIs/aCALp7psJoycyvU7F/+ayFUOmxZ/o1XNo0g5chzWKlfI5q8Qw4D5FmGEz+pXYrL1w==",  
    "SigningCertURL" : "https://sns.us-east-1.amazonaws.com/SimpleNotificationService-bb750dd426d95ee9390147a5624348ee.pem",  
    "UnsubscribeURL" : "https://sns.us-east-1.amazonaws.com/?Action=Unsubscribe&SubscriptionArn=arn:aws:sns:us-east-1:291180941288:A3BXB0YN3XH17HA2K7NDRCTOTPW9:05542723-375e-4609-98f1-8abcf427d95f"
}
