test/com/amazon/payments/paywithamazon/impl/ipn/json/RefundNotification.json

{  
    "Type" : "Notification",  
    "MessageId" : "1c53034e-051f-5fe2-a4e7-4d17c21104eb",  
    "TopicArn" : "arn:aws:sns:us-east-1:291180941288:A3BXB0YN3XH17HA2K7NDRCTOTPW9",  
    "Message" : "{\"MarketplaceID\":\"A3BXB0YN3XH17H\",\"ReleaseEnvironment\":\"Sandbox\",\"Version\":\"2013-01-01\",\"NotificationType\":\"PaymentRefund\",\"SellerId\":\"A2K7NDRCTOTPW9\",\"NotificationReferenceId\":\"1111111-1111-11111-1111-11111EXAMPLE\",\"IsSample\":true,\"Timestamp\":\"2015-08-28T02:17:50.683Z\",\"NotificationData\":\"<?xml version=\\\"1.0\\\" encoding=\\\"UTF-8\\\"?>\\n        <RefundNotification xmlns=\\\"https://mws.amazonservices.com/ipn/OffAmazonPayments/2013-01-01\\\">\\n            <RefundDetails>\\n                <AmazonRefundId>P01-0000000-0000000-000000<\\/AmazonRefundId>\\n                <RefundReferenceId>P01-0000000-0000000-Ref<\\/RefundReferenceId>\\n                <RefundType>SellerInitiated<\\/RefundType>\\n                <RefundAmount>\\n                    <Amount>3.0<\\/Amount>\\n                    <CurrencyCode>USD<\\/CurrencyCode>\\n                <\\/RefundAmount>\\n                <FeeRefunded>\\n                    <Amount>2.0<\\/Amount>\\n                    <CurrencyCode>USD<\\/CurrencyCode>\\n                <\\/FeeRefunded>\\n                <CreationTimestamp>2013-01-01T01:01:01.001Z<\\/CreationTimestamp>\\n                <RefundStatus>\\n                    <State>Completed<\\/State>    \\n                    <LastUpdateTimestamp>2013-01-01T01:01:01.001Z<\\/LastUpdateTimestamp>\\n                        <ReasonCode>None<\\/ReasonCode>                    \\n                <\\/RefundStatus>\\n                <SoftDescriptor>AMZ*softDescriptor<\\/SoftDescriptor>\\n            <\\/RefundDetails>\\n        <\\/RefundNotification>\"}",  
    "Timestamp" : "2015-08-28T02:17:50.722Z",  
    "SignatureVersion" : "1",  
    "Signature" : "gY8bJ8JWxw1jW28Pg3U9CDheqfPYSAYHpLPKyVZwNoc3epJ0YUvAyqs+QKslPAmRm2Dgeb5acDWgEGU+WulcWyK1s7s5uz+Ngr12zyWaZLbvtOuEoimTYZQHsWQNsjtTyjv+Huj4Lm81QOlJs3DSX19N9SMYSiLbhODVo6N+bkuELZBoT5QSx+y9+tb/AEK2zKdbwFwXcCKZryu+igj69hiyDSyKYRRFDs7Zxert7EWGWIQaJBanHV3vggs+sIAUDz7RrAgmJwQ2ktrH89/BQk4GGDT5Z9d6Xu7Mt7VCWkv1E3PU4C5dg7wSVD4+WAt523436llHrNVgD7N39cKl9g==",  
    "SigningCertURL" : "https://sns.us-east-1.amazonaws.com/SimpleNotificationService-bb750dd426d95ee9390147a5624348ee.pem",  
    "UnsubscribeURL" : "https://sns.us-east-1.amazonaws.com/?Action=Unsubscribe&SubscriptionArn=arn:aws:sns:us-east-1:291180941288:A3BXB0YN3XH17HA2K7NDRCTOTPW9:05542723-375e-4609-98f1-8abcf427d95f"
}